In [1]:
import pandas as pd

data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data.csv")

In [2]:
print(data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

akses data memakai kolom

In [3]:
print(data['Age'])

0      19
1      21
2      20
3      23
4      31
       ..
195    35
196    45
197    32
198    32
199    30
Name: Age, Length: 200, dtype: int64

akses data memakai baris

In [4]:
print(data.iloc[1])

CustomerID                   2
Genre                     Male
Age                         21
Annual Income (k$)          15
Spending Score (1-100)      81
Name: 1, dtype: object

**Informasi Statistik**

In [5]:
data.describe(include='all')

,CustomerID,Genre,Age,Annual Income (k$),Spending Score (1-100)
count,200.000000,200,200.000000,200.000000,200.000000
unique,NaN,2,NaN,NaN,NaN
top,NaN,Female,NaN,NaN,NaN
freq,NaN,112,NaN,NaN,NaN
mean,100.500000,NaN,38.850000,60.560000,50.200000
std,57.879185,NaN,13.969007,26.264721,25.823522
min,1.000000,NaN,18.000000,15.000000,1.000000
25%,50.750000,NaN,28.750000,41.500000,34.750000
50%,100.500000,NaN,36.000000,61.500000,50.000000
75%,150.250000,NaN,49.000000,78.000000,73.000000
max,200.000000,NaN,70.000000,137.000000,99.000000

**Informasi Statistik untuk Kolom Numerical**

In [7]:
data.describe(exclude=['O'])

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

**Cek Missing value**

In [8]:
print(data.isnull().values.any())

False

In [9]:
data.mean()

CustomerID                100.50
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [10]:
import pandas as pd

data_missing= pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data_missingvalue.csv")

data

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [11]:
print(data_missing.isnull().values.any())

True

dikarenakan pada dataset diatas terdapat data yang hilang, maka kita akan mencoba memperbaikinya dengan beberapa cara.
Yaitu :

### Mengisi Dengan Mean

Mengisi nilai yang kosong menggunakan nilai mean merupakan metode yang paling umum digunakan. Mengisi nilai yang kosong menggunakan mean sendiri biasanya digunakan pada data yang memiliki sedikit sifat outlier,noisy atau anomali dalam sebaran datanya maupun isinya.

In [12]:
data_missing.mean()

CustomerID                100.500000
Age                        38.939698
Annual Income (k$)         61.005051
Spending Score (1-100)     50.489899
dtype: float64

#### Sebelum diisi dengan Mean

In [13]:
data_missing.head(10)

   CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                    39.0
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                 NaN                     6.0
3           4  Female  23.0                16.0                    77.0
4           5  Female  31.0                17.0                     NaN
5           6  Female  22.0                 NaN                    76.0
6           7  Female  35.0                18.0                     6.0
7           8  Female  23.0                18.0                    94.0
8           9    Male  64.0                19.0                     NaN
9          10  Female  30.0                19.0                    72.0

#### Sesudah diisi dengan Mean

In [14]:
data_missing = data_missing.fillna(data_missing.mean())

In [15]:
data_missing.isnull().values.any()

False

In [16]:
data_missing.head(10)

   CustomerID   Genre        Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.000000           15.000000               39.000000
1           2    Male  38.939698           15.000000               81.000000
2           3  Female  20.000000           61.005051                6.000000
3           4  Female  23.000000           16.000000               77.000000
4           5  Female  31.000000           17.000000               50.489899
5           6  Female  22.000000           61.005051               76.000000
6           7  Female  35.000000           18.000000                6.000000
7           8  Female  23.000000           18.000000               94.000000
8           9    Male  64.000000           19.000000               50.489899
9          10  Female  30.000000           19.000000               72.000000

#### Mengisi dengan Median

Median digunakan untuk data-data yang memiliki sofat outlier yang kuat. Kenapa median, karena median merupakan nilai tengah yang artunya bukan hasil dari perhitungan yang melibatkan outlier. Pada beberapa kasus, data outlier dianggap menggangu dan sering dianggap noisy karena bisa mempengaruhi distribusi kelas dan mengganggu analisa clustering

In [17]:
data_median= pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data_missingvalue.csv")

data_median

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male   NaN                15.0                    81.0
2             3  Female  20.0                 NaN                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                     NaN
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                    83.0

[200 rows x 5 columns]

In [19]:
data_median.isnull().values.any()

True

In [18]:
data_median.median()

CustomerID                100.5
Age                        36.0
Annual Income (k$)         62.0
Spending Score (1-100)     50.0
dtype: float64

In [20]:
data_median = data_median.fillna(data_median.median())

In [21]:
data_median

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  36.0                15.0                    81.0
2             3  Female  20.0                62.0                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                    50.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                    83.0

[200 rows x 5 columns]

### Normalisasi Data

Ada berbagai macam metode normalisasi, seperti MinMax,Ascore,Decimal Scaling, Sigmoid, dan Softmax. Pemakaiannya tergantung pada kebutuhan dataset dan jenis analisa yang dilakukan

#### MinMax

Metode MinMax merupakan metode yang cukup bisa dibayangkan karena termasuk metode normalisasi yang bersifat linear dengan data aslinya. Namun metode ini dapatt menyebabkan out of bound pada beberapa kasus.

![Rumus MinMax](img/minmax.png)

kenapa bisa terjadi out of bound? hal ini terjadi karena apabila ada data baru masuk, dimana data tersebut melebihi nilai maksimal atau nilai minimal dari data yang sudah ada. secara otomatis, perhitungan yang berlaku pada data yang sudah diperoleh tadi harus diulangi ladi semuanya dengan dta baru yang masuk atau data baru yang mempunyai nilai maksimal/minimum yang melebihi tadi tidak bisa diproses. karena kekurangan inilah **minmax tidak cocok untuk untuk analisa real time/evolving sistem**. **MinMax sangat dianjurkan untuk kasus-kasus berbasis time frame analissi dan forecasting**. perhitungan dari metode ini cukup mengurangi data yang asli dengan nilai maximal yang baru dengan biali minimal yang baru kemudian dibagi dengan max dan min data disetiap fitur terakhir ditambah dengan niali min yang baru

#### Z-Score

Z-score adalah meteode yang sering digunakna dalam berbagai penelitian berbasis data mining atau data science. Z-score merupakan metode normalisasi yang berdasarkan mean(niali rata rata) dan standard deviation(deviasi standar) . zscore populer karena tidak banyak variabel yang diset dalam perhitungannya. zscore sangat dinamis dalam melalukakn perhitungan bormalisasi. selain itu elemen yang dibutuhkan untuk perhitungan Z-score juga membutuhkan proses yang cukup lama baik standar deviation ataupun rata-rata setiap kolom.

![](img/zscore.png)

#### Decimal Scaling

![](img/decimalscaling.png)

#### Softmax

Softmax merupakan metode normalisasi pengembangan transformasi secara linier. Output range-nya adalah 0-1. Metode ini sangat berguna pada saat data yang ada melibatkan data outlier.

![](img/softmax.png)

#### Sigmoid

Sigmoidal merupakan metode normalization melakukan normalisasi data secara nonlinier ke dalam range -1 s/d 1 dengan menggunakan fungsi sigmoid. Metode ini sangat berguna pada saat data yang ada melibatkan data outlier. Data outlier adalah data yang keluar jauh dari jangkauan data lainnya

![](img/sigmoid.png)

In [22]:
import pandas as pd
import numpy as np
from sklearn import preprocessing

csv_data = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/shopping_data.csv")
array = csv_data.values		

X = array[:,2:5] #memisahkan fitur dari dataset. 
Y = array[:,0:1]  #memisahkan class dari dataset

dataset=pd.DataFrame({'Customer ID':array[:,0],'Gender':array[:,1],'Age':array[:,2],'Income':array[:,3],'Spending Score':array[:,4]})
print("dataset sebelum dinormalisasi :")
print(dataset.head(10))

min_max_scaler = preprocessing.MinMaxScaler(feature_range=(0,1)) #inisialisasi normalisasi MinMax
data = min_max_scaler.fit_transform(X) #transformasi MinMax untuk fitur
dataset = pd.DataFrame({'Age':data[:,0],'Income':data[:,1],'Spending Score':data[:,2],'Customer ID':array[:,0],'Gender':array[:,1]})

print("dataset setelah dinormalisasi :")
print(dataset.head(10))

dataset sebelum dinormalisasi :
  Customer ID  Gender Age Income Spending Score
0           1    Male  19     15             39
1           2    Male  21     15             81
2           3  Female  20     16              6
3           4  Female  23     16             77
4           5  Female  31     17             40
5           6  Female  22     17             76
6           7  Female  35     18              6
7           8  Female  23     18             94
8           9    Male  64     19              3
9          10  Female  30     19             72
dataset setelah dinormalisasi :
        Age    Income  Spending Score Customer ID  Gender
0  0.019231  0.000000        0.387755           1    Male
1  0.057692  0.000000        0.816327           2    Male
2  0.038462  0.008197        0.051020           3  Female
3  0.096154  0.008197        0.775510           4  Female
4  0.250000  0.016393        0.397959           5  Female
5  0.076923  0.016393        0.765306           6  Female
6  0.326923  0.024590        0.051020           7  Female
7  0.096154  0.024590        0.948980           8  Female
8  0.884615  0.032787        0.020408           9    Male
9  0.230769  0.032787        0.724490          10  Female